---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportDetailNumber
source: html/037ee2cb-5cf6-fdab-c3c1-c4fb78703c51.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportDetailNumber Property

"Detail Number"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportDetailNumber { get; }
```